# Assignment 3 - Descriptive Statistics : Measures of Central Tendency and Variability

1. [nba.csv] Provide summary statistics (mean, median, minimum, maximum, standard deviation) for a dataset (age, income etc.) with numeric variables grouped by one of the qualitative (categorical) variable. For example, if your categorical variable is age groups and quantitative variable is income, then provide summary statistics of income grouped by the age groups. Create a list that contains a numeric value for each response to the categorical variable.

2. [iris.csv] Write a Python program to display some basic statistical details like percentile, mean, standard deviation etc. of the species of ‘Iris-setosa’, ‘Iris-versicolor’ and ‘Iris- verginica’ of iris.csv dataset. Provide the codes with outputs and explain everything that you do in this step.

In [570]:
import pandas as pd

df = pd.read_csv("nba.csv")
df.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.00,PG,25.00,6-2,180.00,Texas,7730337.00
1,Jae Crowder,Boston Celtics,99.00,SF,25.00,6-6,235.00,Marquette,6796117.00
2,John Holland,Boston Celtics,30.00,SG,27.00,6-5,205.00,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.00,SG,22.00,6-5,185.00,Georgia State,1148640.00
4,Jonas Jerebko,Boston Celtics,8.00,PF,29.00,6-10,231.00,NaN,5000000.00

In [571]:
df.columns

Index(['Name', 'Team', 'Number', 'Position', 'Age', 'Height', 'Weight',
       'College', 'Salary'],
      dtype='object')

In [572]:
rename_map = {}
for col in df.columns:
    rename_map.update({col : col.lower()})
    
df = df.rename(columns=rename_map)
    
df.head()

,name,team,number,position,age,height,weight,college,salary
0,Avery Bradley,Boston Celtics,0.00,PG,25.00,6-2,180.00,Texas,7730337.00
1,Jae Crowder,Boston Celtics,99.00,SF,25.00,6-6,235.00,Marquette,6796117.00
2,John Holland,Boston Celtics,30.00,SG,27.00,6-5,205.00,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.00,SG,22.00,6-5,185.00,Georgia State,1148640.00
4,Jonas Jerebko,Boston Celtics,8.00,PF,29.00,6-10,231.00,NaN,5000000.00

In [573]:
df.isna().sum()

name         1
team         1
number       1
position     1
age          1
height       1
weight       1
college     85
salary      12
dtype: int64

In [574]:
df = df.dropna(subset=["name"])
df.isna().sum()

name         0
team         0
number       0
position     0
age          0
height       0
weight       0
college     84
salary      11
dtype: int64

In [575]:
df.salary = df.salary.fillna(df.salary.mean())
df.head()

,name,team,number,position,age,height,weight,college,salary
0,Avery Bradley,Boston Celtics,0.00,PG,25.00,6-2,180.00,Texas,7730337.00
1,Jae Crowder,Boston Celtics,99.00,SF,25.00,6-6,235.00,Marquette,6796117.00
2,John Holland,Boston Celtics,30.00,SG,27.00,6-5,205.00,Boston University,4842684.11
3,R.J. Hunter,Boston Celtics,28.00,SG,22.00,6-5,185.00,Georgia State,1148640.00
4,Jonas Jerebko,Boston Celtics,8.00,PF,29.00,6-10,231.00,NaN,5000000.00

In [576]:
pd.options.display.float_format = "{:.2f}".format
df.head()

,name,team,number,position,age,height,weight,college,salary
0,Avery Bradley,Boston Celtics,0.00,PG,25.00,6-2,180.00,Texas,7730337.00
1,Jae Crowder,Boston Celtics,99.00,SF,25.00,6-6,235.00,Marquette,6796117.00
2,John Holland,Boston Celtics,30.00,SG,27.00,6-5,205.00,Boston University,4842684.11
3,R.J. Hunter,Boston Celtics,28.00,SG,22.00,6-5,185.00,Georgia State,1148640.00
4,Jonas Jerebko,Boston Celtics,8.00,PF,29.00,6-10,231.00,NaN,5000000.00

In [577]:
df.dtypes

name         object
team         object
number      float64
position     object
age         float64
height       object
weight      float64
college      object
salary      float64
dtype: object

In [578]:
df["height"] = df["height"].astype(str).apply(lambda x: x.split("-")[0] + "." + x.split("-")[1])
df["height"] = df["height"].astype("float64")

In [579]:
df["college"] = df["college"].fillna("Unkown")
df.dtypes

name         object
team         object
number      float64
position     object
age         float64
height      float64
weight      float64
college      object
salary      float64
dtype: object

In [580]:
numeric_df = df.select_dtypes(include=["number"])
numeric_df.head()

   number   age  height  weight     salary
0    0.00 25.00    6.20  180.00 7730337.00
1   99.00 25.00    6.60  235.00 6796117.00
2   30.00 27.00    6.50  205.00 4842684.11
3   28.00 22.00    6.50  185.00 1148640.00
4    8.00 29.00    6.10  231.00 5000000.00

In [581]:
numeric_df.mean()

number        17.68
age           26.94
height         6.52
weight       221.52
salary   4842684.11
dtype: float64

In [582]:
for col in numeric_df.columns:
    print(col,f" : {numeric_df[col].mode()[0]}")

number  : 5.0
age  : 24.0
height  : 6.1
weight  : 220.0
salary  : 947276.0

In [583]:
for col in numeric_df.columns:
    print(col,f" : {numeric_df[col].median()}")

number  : 13.0
age  : 26.0
height  : 6.6
weight  : 220.0
salary  : 2869440.0

In [584]:
print("Col\tMin\tMax\t\tRange")
for col in numeric_df.columns:
    col_min = numeric_df[col].min()
    col_max = numeric_df[col].max()
    col_range = col_max - col_min
    print(f"{col}\t{col_min:.2f}\t{col_max:.2f}\t\t{col_range:.2f}")

Col	Min	Max		Range
number	0.00	99.00		99.00
age	19.00	40.00		21.00
height	5.11	7.30		2.19
weight	161.00	307.00		146.00
salary	30888.00	25000000.00		24969112.00

In [585]:
# Group By
# Team
# Age
# Age Intervals

team_group = df.groupby(by="team")
result = team_group["height"].agg(['mean', 'median', 'std', 'min', 'max', 'count']).sort_values(by="mean", ascending=False)
result

                        mean  median  std  min  max  count
team
Toronto Raptors         6.67    6.80 0.33 6.00 7.00     15
Los Angeles Lakers      6.66    6.70 0.32 6.10 7.20     15
New York Knicks         6.62    6.70 0.34 6.10 7.30     16
Charlotte Hornets       6.61    6.60 0.33 6.10 7.10     15
Utah Jazz               6.61    6.60 0.39 6.10 7.30     15
Portland Trail Blazers  6.59    6.60 0.34 6.10 7.10     15
Orlando Magic           6.59    6.65 0.36 6.10 7.00     14
Detroit Pistons         6.55    6.60 0.27 6.10 6.90     15
Boston Celtics          6.55    6.60 0.34 5.90 7.00     15
Houston Rockets         6.55    6.60 0.36 6.10 7.00     15
Golden State Warriors   6.54    6.60 0.31 6.10 7.00     15
Sacramento Kings        6.54    6.60 0.36 6.00 7.00     15
San Antonio Spurs       6.53    6.60 0.38 6.00 7.30     15
Miami Heat              6.53    6.60 0.32 6.10 7.00     15
Atlanta Hawks           6.52    6.50 0.36 6.10 7.30     15
New Orleans Pelicans    6.52    6.60 0.33 6.10 7.20     19
Denver Nuggets          6.51    6.60 0.37 6.00 7.00     15
Cleveland Cavaliers     6.51    6.50 0.32 6.10 7.10     15
Chicago Bulls           6.51    6.60 0.36 6.00 7.00     15
Phoenix Suns            6.49    6.60 0.50 5.11 7.10     15
Dallas Mavericks        6.48    6.30 0.42 6.00 7.20     15
Los Angeles Clippers    6.47    6.50 0.30 6.00 6.90     15
Washington Wizards      6.47    6.50 0.28 6.10 6.90     15
Philadelphia 76ers      6.46    6.40 0.39 6.00 7.00     15
Milwaukee Bucks         6.45    6.45 0.29 6.10 6.90     16
Oklahoma City Thunder   6.43    6.40 0.32 6.10 7.00     15
Minnesota Timberwolves  6.42    6.30 0.35 6.10 7.00     14
Memphis Grizzlies       6.42    6.35 0.32 6.10 7.10     18
Indiana Pacers          6.37    6.30 0.47 5.11 6.90     15
Brooklyn Nets           6.35    6.30 0.45 5.11 7.00     15

In [586]:
age_group = df.groupby(by="age")
result = age_group["height"].agg(['mean', 'median', 'std', 'min', 'max', 'count']).sort_values(by="count", ascending=False)
result

       mean  median  std  min  max  count
age
24.00  6.51    6.50 0.31 6.10 7.30     47
25.00  6.47    6.50 0.37 5.11 7.00     45
27.00  6.44    6.30 0.36 5.90 7.30     41
23.00  6.59    6.60 0.36 5.11 7.10     41
26.00  6.51    6.55 0.37 6.10 7.30     36
30.00  6.50    6.50 0.31 6.00 7.00     31
28.00  6.49    6.50 0.45 5.11 7.20     31
29.00  6.63    6.80 0.37 6.10 7.20     28
22.00  6.57    6.60 0.33 6.10 7.10     26
31.00  6.45    6.35 0.39 6.00 7.10     22
21.00  6.53    6.50 0.30 6.10 7.00     19
20.00  6.61    6.70 0.35 6.10 7.30     19
33.00  6.47    6.30 0.37 6.10 7.10     14
32.00  6.40    6.30 0.30 6.10 6.90     13
34.00  6.48    6.40 0.35 6.00 7.00     10
36.00  6.64    6.70 0.26 6.10 6.90     10
35.00  6.68    6.70 0.28 6.10 7.00      9
38.00  6.40    6.40 0.29 6.10 6.70      4
37.00  6.65    6.75 0.40 6.10 7.00      4
40.00  6.17    6.11 0.11 6.11 6.30      3
39.00  6.45    6.45 0.21 6.30 6.60      2
19.00  6.60    6.60 0.00 6.60 6.60      2

In [587]:
bins = [15,18,22,25,28,32,35,38,42,50]
labels = []
for i in range(len(bins) - 1):
    labels.append(f"{bins[i]}-{bins[i+1]}")

df["age_group"] = pd.cut(df['age'], bins=bins, labels=labels, right=True)

age_bin_group = df.groupby(by="age_group", observed=False)
result = age_bin_group["height"].agg(["min", "max", "mean", "count"])
result

           min  max  mean  count
age_group
15-18      NaN  NaN   NaN      0
18-22     6.10 7.30  6.57     66
22-25     5.11 7.30  6.52    133
25-28     5.11 7.30  6.48    108
28-32     6.00 7.20  6.51     94
32-35     6.00 7.10  6.53     33
35-38     6.10 7.00  6.59     18
38-42     6.11 6.60  6.28      5
42-50      NaN  NaN   NaN      0

In [588]:
df.describe()

       number    age  height  weight      salary
count  457.00 457.00  457.00  457.00      457.00
mean    17.68  26.94    6.52  221.52  4842684.11
std     15.97   4.40    0.35   26.37  5165780.63
min      0.00  19.00    5.11  161.00    30888.00
25%      5.00  24.00    6.11  200.00  1100602.00
50%     13.00  26.00    6.60  220.00  2869440.00
75%     25.00  30.00    6.80  240.00  6331404.00
max     99.00  40.00    7.30  307.00 25000000.00